Tekla.Structures.AnalysisInternal.DotAnalysisBar
The serialization structure for AnalysisBar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.AnalysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._AnalysisType
The analysis type of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._CardinalPoint
The cardinal point of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._Material
The material of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._ProfileNameStart
The name of the profile at the start.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._ProfileNameEnd
The name of the profile at the end.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._Curvature
The curvature of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._Composite
The composite beam of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._Label
The label of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar._AnalysisDesignCode
The analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.ToStruct(Tekla.Structures.Analysis.AnalysisBar)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.FromStruct(Tekla.Structures.Analysis.AnalysisBar)
DO NOT USE! For internal usage only!
P: P.